Repository: GrimaldiWilliam/SmokeTracker
Catalog: lib/l10n/app_*.arb
Languages: fr

# aboutDescriptionTitle
source: ExHale - Quit Smoking Tracker
fr: ExHale - Stats pour arrêter de fumer

# aboutScreenTitle
source: About ExHale
fr: Quant à ExHale

# aboutLinksViewSourceCode
source: View Source Code
fr: Voir le code source

# aboutPrivacyTitle
source: Privacy and Open Source
fr: Vie privée et code source ouvert

# aboutPrivacyText
source: ExHale respects your privacy. It does not track your data, and all your information is stored locally on your device. The source code is available for review, ensuring complete transparency.
fr: ExHale respecte votre vie privée. L'application ne collecte pas vos données et toutes vos informations sont stockées localement sur votre appareil. Le code source est disponible pour être examiné, ce qui garantit une transparence totale.

# aboutLinksTitle
source: Links
fr: Liens

# aboutLinksReportAnIssue
source: Report an Issue
fr: Signaler un problème

# aboutCreditsTitle
source: Credits
fr: Crédits

# aboutCreditsOpenMoji
source: Visit OpenMoji
fr: Visiter OpenMoji

# aboutCreditsMyWebsite
source: Visit My Website
fr: Visiter mon site web

# aboutDescriptionText
source: ExHale is an open-source app designed to help you track the time since you last smoked and see the progress you've made. It calculates the number of cigarettes avoided and the money you've saved based on your smoking habits.
fr: ExHale est une application libre conçue pour vous aider à suivre le temps écoulé depuis que vous avez fumé pour la dernière fois et à voir les progrès que vous avez réalisés. Elle calcule le nombre de cigarettes évitées et l'argent que vous avez économisé en fonction de vos habitudes tabagiques.

# aboutCreditsText
source: The app icon is provided by OpenMoji - an open-source emoji project. Thanks to OpenMoji for their amazing work!
fr: L'icône de l'application est fournie par OpenMoji - un projet open-source d'emoji. Merci à OpenMoji pour leur travail remarquable !

# configSnackBarValidNumber
source: Please enter valid numbers before saving.
fr: Veuillez entrer des chiffres valides avant de sauvegarder.

# friendsDialogUIDCopiedToClipboard
source: Copied to clipboard!
fr: Copié dans le presse-papiers !

# configDialogEnableFriendsDataText
source: Enabling the Friends requires an internet connection and will share your device's random UID and stats with the server: exhale.retiolus.net.
fr: L'activation des Amis nécessite une connexion internet, partager l'UID aléatoire et les statistiques de votre appareil avec le serveur : exhale.retiolus.net.

# friendsMoneySavedText
source: Money Saved: ${moneySaved}
fr: Argent économisé : ${moneySaved}

# friendsDialogAddFriendTitle
source: Add Friend
fr: Ajouter un(e) ami(e)

# friendsLastSmokedText
source: Last Smoked: {lastSmoked}
fr: Dernière cigarette : {lastSmoked}

# configOptionPriceHistoryText
source: Price History
fr: Historique des prix

# friendsDialogAddFriendNameText
source: Name
fr: Nom

source: Cancel
fr: Annuler

source: Close
fr: Fermer

source: Confirm
fr: Confirmer

source: Name
fr: Nom

source: Save
fr: Enregister

# configDialogEnableFriendsTitle
source: Enable Friends
fr: Activer les amis

# configDialogEnableFriendsSourceCodeText
source: The source code of the API is available at:
fr: Le code source de l'API est disponible à l'adresse suivante :

# configOptionEnableFriendsText
source: Enable Friends
fr: Activer les amis

# configOptionPacketsPerWeekText
source: Packets per week
fr: Paquets par semaine

# configOptionCigarettesPerPacketText
source: Cigarettes per packet
fr: Cigarettes par paquet

# configOptionCounterStartDateText
source: Counter Start Date
fr: Date de début du compteur

# configOptionCounterStartDateSelectText
source: Select a date
fr: Sélectionnez une date

# configOptionPriceHistoryPriceText
source: Price
fr: Prix de vente

# configButtonAddPriceText
source: Add Price
fr: Ajouter un prix

# friendsDialogUIDYourQRText
source: Your QR Code
fr: Votre code QR

# friendsDialogUIDNotAvailable
source: No User UID available
fr: Pas d'UID d'utilisateur disponible

# friendsDialogUIDNoUserUID
source: No User UID
fr: Pas d'UID d'utilisateur

# friendsSnackBarSyncFailed
source: Failed to sync data.
fr: Échec de la synchronisation des données.

# friendsScreenTitle
source: Friends
fr: Amis

# friendsNoFriendsText
source: No friends yet, Add some to see their progress!
fr: Pas encore d'amis, ajoutez-en pour voir leurs progrès !

# friendsCigarettesAvoidedText
source: Cigarettes avoided: {cigAvoided}
fr: Cigarettes évitées : {cigAvoided}

# friendsLastAnnouncedText
source: Last Announced: {lastAnnounced}
fr: Dernière annonce : {lastAnnounced}

# friendsButtonShowUID
source: Show my UID
fr: Afficher mon UID

# friendsButtonAddFriend
source: Add Friend
fr: Ajouter un(e) ami(e)

# homeMenuAbout
source: About
fr: À propos

# homeCigarettesAvoidedText
source: Cigarettes avoided: {cigarettesAvoided}
fr: Cigarettes évitées :{cigarettesAvoided}

# homeMoneySavedText
source: Money saved: ${moneySaved}
fr: Argent économisé : ${moneySaved}

# homeStartCounterText
source: Start Counter
fr: Démarrer le compteur

# homeRestartProgressText
source: Restart Progress
fr: Redémarrer la progression

# friendsDialogUIDCopyUID
source: Copy UID
fr: Copier l'UID

# friendsSnackBarSyncSuccessfull
source: Data synced successfully!
fr: Les données ont été synchronisées avec succès !

# friendsButtonShowUIDEnterUIDText
source: Enter UID Manually
fr: Saisir manuellement l'UID

# friendsDialogEditFriendsNameTitle
source: Edit Friend's Name
fr: Modifier le nom de l'ami

# homeSnackBarFriendsDisabled
source: Friends screen is disabled in settings.
fr: L'écran des amis est désactivé dans les paramètres.
